import pandas as pd

# 创建四个数据框
df_a_quantitative = pd.DataFrame({
    'Index': ['BCD4501', 'BCD465', 'BCD500', '5618两门', 'BCD530', 'BCD580', '5620三门', '5620两门', 'BCD320'],
    'B_0': [0, 80, 0, 100, 100, 80, 24, 24, 87],
    'B_1': [0, 100, 0, 100, 74, 80, 100, 100, 100],
    'B_2': [120, 100, 0, 100, 100, 123, 100, 100, 100],
    'B_3': [84, 100, 120, 100, 0, 160, 100, 100, 100],
    'B_4': [120, 100, 120, 100, 0, 160, 0, 0, 100],
    'B_5': [120, 0, 120, 194, 0, 80, 0, 0, 0],
    'delay': [0, 0, 0, 0, 0, 0, 0, 0, 0]
})

df_a_layout = pd.DataFrame({
    'Index': ['BCD4501', 'BCD465', 'BCD500', '5618两门', 'BCD530', 'BCD580', '5620三门', '5620两门', 'BCD320'],
    'B_0': [0, 100, 0, 100, 100, 80, 24, 24, 87],
    'B_1': [0, 100, 0, 100, 74, 80, 100, 100, 100],
    'B_2': [120, 100, 0, 100, 100, 123, 100, 100, 100],
    'B_3': [84, 100, 120, 100, 0, 160, 100, 100, 100],
    'B_4': [120, 100, 120, 100, 0, 160, 0, 0, 100],
    'B_5': [120, 0, 120, 194, 0, 80, 0, 0, 0],
    'delay': [0, 0, 0, 0, 0, 0, 0, 0, 0]
})

df_b_quantitative = pd.DataFrame({
    'Index': ['BCD4501', 'BCD465', 'BCD500', '5618两门', 'BCD530', 'BCD580', '5620三门', '5620两门', 'BCD320'],
    'B_0': [0, 80, 0, 100, 100, 80, 24, 24, 87],
    'B_1': [0, 100, 0, 100, 74, 80, 100, 100, 100],
    'B_2': [120, 100, 0, 100, 100, 123, 100, 100, 100],
    'B_3': [84, 100, 120, 100, 0, 160, 100, 100, 100],
    'B_4': [120, 100, 120, 100, 0, 160, 0, 0, 100],
    'B_5': [120, 0, 120, 194, 0, 80, 0, 0, 0],
    'delay': [0, 0, 0, 0, 0, 0, 0, 0, 0]
})

df_b_layout = pd.DataFrame({
    'Index': ['BCD4501', 'BCD465', 'BCD500', '5618两门', 'BCD530', 'BCD580', '5620三门', '5620两门', 'BCD320'],
    'B_0': [0, 100, 0, 100, 100, 80, 24, 24, 87],
    'B_1': [0, 100, 0, 100, 74, 80, 100, 100, 100],
    'B_2': [120, 100, 0, 100, 100, 123, 100, 100, 100],
    'B_3': [84, 100, 120, 100, 0, 160, 100, 100, 100],
    'B_4': [120, 100, 120, 100, 0, 160, 0, 0, 100],
    'B_5': [120, 0, 120, 194, 0, 80, 0, 0, 0],
    'delay': [0, 0, 0, 0, 0, 0, 0, 0, 0]
})

# 将数据框保存为一个JSON文件
output_json_path = 'output_data.json'
with open(output_json_path, 'w') as json_file:
    json_file.write('{"A_quantitative":')
    df_a_quantitative.to_json(json_file, orient='records')
    json_file.write(',"A_layout":')
    df_a_layout.to_json(json_file, orient='records')
    json_file.write(',"B_quantitative":')
    df_b_quantitative.to_json(json_file, orient='records')
    json_file.write(',"B_layout":')
    df_b_layout.to_json(json_file, orient='records')
    json_file.write('}')
